package jinsiuoooooo;

public class siuoooooooooooo {
/*	10진수 (숫자가 10개)
 *  
 *  0 1 2 3 4 5 6 7 8 9 10
 *  
 * 	표기숫자									실제값
 * 	15		=> 10 x 1 + 5					15
 * 	25		=> 10 x 2 + 5					25           
 * 	325		=> 10^2 x 3 + 10 x 2 + 5		325
 * 
 * 	8진수 (숫자가 8개)
 * 					8  9	
 *  0 1 2 3 4 5 6 7 10 11 12 13 14 15 16 17
 * 
 * 	표기숫자					실제값
 * 	15 		=> 8 x 1 + 5	13
 * 	25 		=> 8 x 2 + 5	21
 * 	
 * 	2진수 (숫자가 2개)
 * 		2	  4               8
 * 	0 1 10 11 100 101 110 111 1000 ... 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
	
	
	
	
	
}
